tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
#include "ble_data_handler.h"

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <string>

#include "cJSON.h"
#include "ch583_wifi_uart_protocol.h"
#include "debug_output.h"
#include "esp_app_desc.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_ota_ops.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "nvs.h"
#include "server_network_sta.h"
#include "server_network_sta_wifi_credential.h"
#include "server_network_sta_wifi_recovery.h"
#include "server_network_sta_wifi_work_time.h"
#include "tdx_cfg.h"
#include "user_app.h"

static const char *TAG = "ble_data";

static_assert(WIFI_CONFIG_RESULT_TIMEOUT_MS <=
                  WIFI_CONNECT_POWER_GUARD_MAX_MS,
              "WiFi config result timeout must not exceed its power guard");

typedef struct {
    char func[32];
    char ssid[SERVER_NETWORK_STA_WIFI_SSID_BUFFER_SIZE];
    char key[SERVER_NETWORK_STA_WIFI_PASSWORD_BUFFER_SIZE];
} wifi_config_json_t;

typedef struct {
    char func[32];
    int seconds;
} wifi_work_time_json_t;

static wifi_config_json_t wifi_cfg;
static wifi_work_time_json_t wifi_work_time_cfg;
static uint8_t Bl_Data_Ready = 0;
static uint8_t Wifi_connect_OK = 0;
uint8_t net_connect_OK = 0;
bool WiFi_config_net = false;
bool WiFi_config_from_ch583 = false;
bool WiFi_config_from_ble = false;

#define WIFI_INFO_NOTIFY_RETRY_COUNT 3
#define WIFI_INFO_NOTIFY_RETRY_DELAY_MS 150
#define WIFI_INFO_IP_READY_RECHECK_COUNT 3
#define WIFI_INFO_IP_READY_RECHECK_DELAY_MS 300

#if USER_BLE_ENABLE
typedef struct {
    uint16_t len;
    uint8_t data[USER_BLE_JSON_BUF_SIZE];
} user_ble_write_msg_t;

static QueueHandle_t s_ble_write_queue = NULL;
static TaskHandle_t s_ble_write_task = NULL;
#endif

typedef bool (*json_sender_t)(const char *json);

static bool ble_send_json(const char *json)
{
    if (json == NULL) {
        return false;
    }
    ESP_LOGI(TAG, "BLE TX JSON: %s", json);
#if USER_BLE_ENABLE
    return SendData_indicate((uint8_t *)json, (uint16_t)strlen(json)) == ESP_OK;
#else
    return ch583_wifi_uart_send_wifi_data(json) == 0;
#endif
}

static bool ch583_send_json(const char *json)
{
    if (json == NULL) {
        return false;
    }
    ESP_LOGI(TAG, "CH583 TX JSON: %s", json);
    return ch583_wifi_uart_send_wifi_data(json) == 0;
}

static json_sender_t s_active_send_json = ble_send_json;

static bool nvs_has_nonempty_str(const char *name_space, const char *key)
{
    nvs_handle_t handle = 0;
    size_t len = 0;
    bool has_value = false;

    if (nvs_open(name_space, NVS_READONLY, &handle) != ESP_OK) {
        return false;
    }

    if (nvs_get_str(handle, key, NULL, &len) == ESP_OK && len > 1) {
        has_value = true;
    }
    nvs_close(handle);
    return has_value;
}

static bool nvs_has_nonempty_blob_string(const char *name_space, const char *key)
{
    nvs_handle_t handle = 0;
    size_t len = 0;
    bool has_value = false;

    if (nvs_open(name_space, NVS_READONLY, &handle) != ESP_OK) {
        return false;
    }

    if (nvs_get_blob(handle, key, NULL, &len) == ESP_OK && len > 0) {
        uint8_t *value = (uint8_t *)malloc(len);
        if (value != NULL) {
            if (nvs_get_blob(handle, key, value, &len) == ESP_OK && value[0] != '\0') {
                has_value = true;
            }
            free(value);
        }
    }
    nvs_close(handle);
    return has_value;
}

static bool ble_has_saved_wifi_info(void)
{
    if (nvs_has_nonempty_str("wifi", "ssid")) {
        return true;
    }
    return nvs_has_nonempty_blob_string("nvs.net80211", "sta.ssid");
}

static void send_simple_result_with_sender(json_sender_t send_json,
                                           const char *func,
                                           int result,
                                           const char *message)
{
    char json[192];

    if (message == NULL || message[0] == '\0') {
        snprintf(json, sizeof(json), "{\"func\":\"%s\",\"result\":%d}",
                 func, result);
    } else {
        snprintf(json, sizeof(json), "{\"func\":\"%s\",\"result\":%d,\"message\":\"%s\"}",
                 func, result, message);
    }
    if (!send_json(json) && result != TDX_JSON_RESULT_BLE_SEND_FAILED) {
        ESP_LOGE(TAG, "JSON response send failed func=%s result=%d", func, result);
        snprintf(json, sizeof(json),
                 "{\"func\":\"ble_json_result\",\"result\":%d,\"message\":\"response send failed\"}",
                 TDX_JSON_RESULT_BLE_SEND_FAILED);
        (void)send_json(json);
    }
}

static bool send_base_info_to_mobile(void)
{
    char ip_str[sizeof("255.255.255.255")];
    char ssid_str[SERVER_NETWORK_STA_WIFI_SSID_BUFFER_SIZE] = {0};
    char ble_ver_str[4];
    char version_str[40];

    const esp_app_desc_t *app = esp_app_get_description();
    const esp_partition_t *running = esp_ota_get_running_partition();
    uint8_t ble_ver = ch583_wifi_uart_get_ble_ver();

    esp_netif_ip_info_t ip = {};
    esp_netif_t *esp_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    wifi_ap_record_t ap_info = {};

    if (esp_netif == NULL ||
        esp_netif_get_ip_info(esp_netif, &ip) != ESP_OK ||
        ip.ip.addr == 0) {
        ESP_LOGW(TAG, "wifi_info_result not sent: STA IP is not ready");
        return false;
    }

    net_connect_OK = 1;
    working_time = 0;

    snprintf(ip_str, sizeof(ip_str), IPSTR, IP2STR(&ip.ip));

    if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
        size_t ssid_length = strnlen((const char *)ap_info.ssid,
                                     sizeof(ap_info.ssid));
        memcpy(ssid_str, ap_info.ssid, ssid_length);
        ssid_str[ssid_length] = '\0';
    }
    snprintf(ble_ver_str, sizeof(ble_ver_str), "%u", (unsigned int)ble_ver);
    snprintf(version_str, sizeof(version_str), "%s:%s",
             app != NULL ? app->version : "", ble_ver_str);

    cJSON *root = cJSON_CreateObject();
    if (root == NULL ||
        cJSON_AddStringToObject(root, "func", "wifi_info_result") == NULL ||
        cJSON_AddNumberToObject(root, "result", TDX_JSON_RESULT_OK) == NULL ||
        cJSON_AddStringToObject(root, "message", "wifi info") == NULL ||
        cJSON_AddStringToObject(root, "stage", ip_str) == NULL ||
        cJSON_AddStringToObject(root, "WiFi", ssid_str) == NULL ||
        cJSON_AddStringToObject(root, "version", version_str) == NULL ||
        cJSON_AddStringToObject(root, "date",
                               app != NULL ? app->date : "") == NULL ||
        cJSON_AddStringToObject(root, "running",
                               running != NULL ? running->label : "") == NULL) {
        cJSON_Delete(root);
        ESP_LOGE(TAG, "wifi_info_result JSON allocation failed");
        return false;
    }
    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    if (json_str == NULL) {
        ESP_LOGE(TAG, "wifi_info_result JSON serialization failed");
        return false;
    }

    ESP_LOGI(TAG, "wifi_info_result send start ip=%s len=%u",
             ip_str,
             (unsigned int)strlen(json_str));

    for (int attempt = 1; attempt <= WIFI_INFO_NOTIFY_RETRY_COUNT; attempt++) {
        if (s_active_send_json(json_str)) {
            ESP_LOGI(TAG, "wifi_info_result sent ip=%s attempt=%d", ip_str, attempt);
#if (USER_BLE_ENABLE == 1)
            UserDebugOutput_Printf("JSON:\n%s\n", json_str);
#endif
            cJSON_free(json_str);
            return true;
        }

