tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
static TaskHandle_t s_wifi_connect_task = NULL;
static json_sender_t s_wifi_connect_reply_sender = NULL;
static bool s_wifi_connect_notify_result = false;
static const char *s_wifi_connect_result_func = NULL;
static bool s_wifi_connect_new_credential = false;
static TickType_t s_wifi_connect_request_start_tick = 0;
static bool s_wifi_wakeup_observer_active = false;
// Only a wifi_wakeup-owned worker accepts one latest saved credential as pending work.
static portMUX_TYPE s_wifi_connect_flow_lock = portMUX_INITIALIZER_UNLOCKED;
static bool s_wifi_connect_submit_in_progress = false;
static bool s_wifi_connect_wakeup_flow = false;
static uint8_t s_wifi_pending_config_state = WIFI_PENDING_CONFIG_NONE;
static uint32_t s_wifi_pending_config_generation = 0;
static json_sender_t s_wifi_pending_config_sender = NULL;
static TickType_t s_wifi_pending_config_start_tick = 0;

static bool wifi_connect_task_is_active(void)
{
    bool active = false;
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    active = s_wifi_connect_task != NULL ||
             s_wifi_connect_submit_in_progress;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return active;
}

static uint32_t reserve_wifi_config_behind_wakeup(
    json_sender_t reply_sender,
    TickType_t request_start_tick)
{
    uint32_t generation = 0;
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    if ((s_wifi_connect_task != NULL ||
         s_wifi_connect_submit_in_progress) &&
        s_wifi_connect_wakeup_flow) {
        generation = ++s_wifi_pending_config_generation;
        if (generation == 0) {
            generation = ++s_wifi_pending_config_generation;
        }
        s_wifi_pending_config_state = WIFI_PENDING_CONFIG_SAVING;
        s_wifi_pending_config_sender = reply_sender;
        s_wifi_pending_config_start_tick = request_start_tick;
    }
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return generation;
}

static bool finish_wifi_config_reservation(uint32_t generation, bool saved)
{
    bool finished = false;
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    if (generation != 0 &&
        generation == s_wifi_pending_config_generation &&
        s_wifi_pending_config_state == WIFI_PENDING_CONFIG_SAVING) {
        bool wakeup_owner_active =
            (s_wifi_connect_task != NULL ||
             s_wifi_connect_submit_in_progress) &&
            s_wifi_connect_wakeup_flow;
        if (saved && wakeup_owner_active) {
            s_wifi_pending_config_state = WIFI_PENDING_CONFIG_READY;
            finished = true;
        } else {
            s_wifi_pending_config_state = WIFI_PENDING_CONFIG_NONE;
            s_wifi_pending_config_sender = NULL;
            s_wifi_pending_config_start_tick = 0;
            finished = !saved;
        }
    }
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return finished;
}

static bool wifi_config_is_queued_behind_wakeup(void)
{
    bool queued = false;
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    queued = s_wifi_pending_config_state != WIFI_PENDING_CONFIG_NONE;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return queued;
}

static int take_pending_wifi_config_or_finish(
    json_sender_t *reply_sender,
    TickType_t *request_start_tick)
{
    int action = WIFI_PENDING_TAKE_FINISH;
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    if (s_wifi_pending_config_state == WIFI_PENDING_CONFIG_READY) {
        if (reply_sender != NULL) {
            *reply_sender = s_wifi_pending_config_sender;
        }
        if (request_start_tick != NULL) {
            *request_start_tick = s_wifi_pending_config_start_tick;
        }
        s_wifi_pending_config_state = WIFI_PENDING_CONFIG_NONE;
        s_wifi_pending_config_sender = NULL;
        s_wifi_pending_config_start_tick = 0;
        s_wifi_connect_wakeup_flow = false;
        action = WIFI_PENDING_TAKE_READY;
    } else if (s_wifi_pending_config_state == WIFI_PENDING_CONFIG_SAVING) {
        action = WIFI_PENDING_TAKE_WAIT;
    } else {
        s_wifi_connect_wakeup_flow = false;
        s_wifi_connect_task = NULL;
    }
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return action;
}

static void wait_wifi_connect_task_published(void)
{
    while (true) {
        bool published = false;
        portENTER_CRITICAL(&s_wifi_connect_flow_lock);
        published = !s_wifi_connect_submit_in_progress;
        portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
        if (published) {
            return;
        }
        vTaskDelay(1);
    }
}

static const char *wifi_stage_from_status(const server_network_sta_status_t& status)
{
    switch (status.state) {
    case SERVER_NETWORK_STA_STATE_READY: return "ready";
    case SERVER_NETWORK_STA_STATE_CONNECTING: return "connecting";
    case SERVER_NETWORK_STA_STATE_DISCONNECTING: return "disconnecting";
    case SERVER_NETWORK_STA_STATE_WAITING_IP: return "waiting_ip";
    case SERVER_NETWORK_STA_STATE_RETRY_WAIT: return "retry_wait";
    case SERVER_NETWORK_STA_STATE_GOT_IP: return "got_ip";
    case SERVER_NETWORK_STA_STATE_STARTING_SERVICES: return "starting_services";
    case SERVER_NETWORK_STA_STATE_AUTH_FAILED: return "auth_failed";
    case SERVER_NETWORK_STA_STATE_NO_CONFIG: return "no_wifi";
    case SERVER_NETWORK_STA_STATE_FAILED: return "error";
    case SERVER_NETWORK_STA_STATE_IDLE: return "idle";
    default: return "unknown";
    }
}

static uint32_t wifi_retry_after_ms(const server_network_sta_status_t& status)
{
    switch (status.retry_type) {
    case SERVER_NETWORK_RETRY_WIFI: return status.wifi_retry_after_ms;
    case SERVER_NETWORK_RETRY_HTTP: return status.http_retry_after_ms;
    case SERVER_NETWORK_RETRY_MDNS: return status.mdns_retry_after_ms;
    default: return 0;
    }
}

static bool wifi_status_is_progressing(const server_network_sta_status_t& status)
{
    return status.state == SERVER_NETWORK_STA_STATE_CONNECTING ||
           status.state == SERVER_NETWORK_STA_STATE_DISCONNECTING ||
           status.state == SERVER_NETWORK_STA_STATE_WAITING_IP ||
           status.state == SERVER_NETWORK_STA_STATE_RETRY_WAIT ||
           status.state == SERVER_NETWORK_STA_STATE_GOT_IP ||
           status.state == SERVER_NETWORK_STA_STATE_STARTING_SERVICES;
}

static bool wifi_status_is_ready(const server_network_sta_status_t& status)
{
    return status.state == SERVER_NETWORK_STA_STATE_READY &&
           status.has_ip &&
           status.http_ready &&
           status.ip[0] != '\0';
}

