tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
typedef enum {
    WIFI_CONFIG_OBSERVE_READY,
    WIFI_CONFIG_OBSERVE_TIMEOUT,
    WIFI_CONFIG_OBSERVE_AUTH_FAILED
} wifi_config_observe_result_t;

static wifi_config_observe_result_t wait_wifi_config_result_until_deadline(
    TickType_t request_start_tick)
{
    const TickType_t timeout_ticks =
        pdMS_TO_TICKS(WIFI_CONFIG_RESULT_TIMEOUT_MS);
    const TickType_t poll_ticks =
        pdMS_TO_TICKS(WIFI_CONFIG_RESULT_STATUS_POLL_MS);
    server_network_sta_status_t status = {};
    bool status_error_logged = false;

    while ((xTaskGetTickCount() - request_start_tick) < timeout_ticks) {
        esp_err_t status_ret = ServerNetworkSta_GetStatus(&status);
        if (status_ret != ESP_OK) {
            if (!status_error_logged) {
                ESP_LOGE(TAG,
                         "WiFi config result status read failed; waiting for absolute deadline ret=%s",
                         esp_err_to_name(status_ret));
                status_error_logged = true;
            }
        } else {
            if (wifi_status_is_ready(status)) {
                ESP_LOGI(TAG,
                         "WiFi config connected before deadline ip=%s elapsed_ms=%lu",
                         status.ip,
                         (unsigned long)pdTICKS_TO_MS(
                             xTaskGetTickCount() - request_start_tick));
                return WIFI_CONFIG_OBSERVE_READY;
            }
            if (status.state == SERVER_NETWORK_STA_STATE_AUTH_FAILED ||
                status.last_result == TDX_JSON_RESULT_WIFI_AUTH_FAILED) {
                ESP_LOGE(TAG,
                         "WiFi config authentication failed elapsed_ms=%lu reason=%d",
                         (unsigned long)pdTICKS_TO_MS(
                             xTaskGetTickCount() - request_start_tick),
                         status.disconnect_reason);
                return WIFI_CONFIG_OBSERVE_AUTH_FAILED;
            }
        }

        TickType_t elapsed_ticks = xTaskGetTickCount() - request_start_tick;
        if (elapsed_ticks >= timeout_ticks) {
            break;
        }
        TickType_t remaining_ticks = timeout_ticks - elapsed_ticks;
        vTaskDelay(poll_ticks < remaining_ticks ? poll_ticks : remaining_ticks);
    }

    /* Re-read at the boundary so READY cannot race with the final 1307. */
    server_network_sta_status_t boundary_status = {};
    if (ServerNetworkSta_GetStatus(&boundary_status) == ESP_OK) {
        status = boundary_status;
    }
    if (wifi_status_is_ready(status)) {
        ESP_LOGI(TAG,
                 "WiFi config connected at deadline boundary ip=%s elapsed_ms=%lu",
                 status.ip,
                 (unsigned long)pdTICKS_TO_MS(
                     xTaskGetTickCount() - request_start_tick));
        return WIFI_CONFIG_OBSERVE_READY;
    }
    if (status.state == SERVER_NETWORK_STA_STATE_AUTH_FAILED ||
        status.last_result == TDX_JSON_RESULT_WIFI_AUTH_FAILED) {
        ESP_LOGE(TAG,
                 "WiFi config authentication failed at deadline reason=%d",
                 status.disconnect_reason);
        return WIFI_CONFIG_OBSERVE_AUTH_FAILED;
    }

    ESP_LOGW(TAG,
             "WiFi config final timeout elapsed_ms=%lu state=%s last=%d reason=%d",
             (unsigned long)pdTICKS_TO_MS(
                 xTaskGetTickCount() - request_start_tick),
             ServerNetworkSta_StateName(status.state),
             status.last_result,
             status.disconnect_reason);
    return WIFI_CONFIG_OBSERVE_TIMEOUT;
}

static int wait_wifi_wakeup_ready_during_grace(
    TickType_t request_start_tick,
    server_network_sta_status_t *final_status)
{
    const TickType_t total_timeout_ticks =
        pdMS_TO_TICKS(WIFI_CONNECT_POWER_GUARD_MAX_MS);
    const TickType_t grace_timeout_ticks =
        pdMS_TO_TICKS(WIFI_WAKEUP_EARLY_1307_GRACE_MS);
    const TickType_t poll_ticks =
        pdMS_TO_TICKS(WIFI_WAKEUP_RESULT_POLL_DELAY_MS);
    const TickType_t grace_start_tick = xTaskGetTickCount();
    server_network_sta_status_t status = {};

    while (true) {
        if (wifi_config_is_queued_behind_wakeup()) {
            if (final_status != NULL) {
                *final_status = status;
            }
            ESP_LOGI(TAG, "wifi_wakeup deferred notify cancelled by new credential");
            return WIFI_WAKEUP_WAIT_CONFIG_QUEUED;
        }

        if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
            ESP_LOGE(TAG, "wifi_wakeup deferred result status read failed");
            if (final_status != NULL) {
                memset(final_status, 0, sizeof(*final_status));
            }
            return WIFI_WAKEUP_WAIT_STATUS_ERROR;
        }

        if (wifi_status_is_ready(status)) {
            if (final_status != NULL) {
                *final_status = status;
            }
            ESP_LOGI(TAG,
                     "wifi_wakeup recovered before notify timeout ip=%s elapsed_ms=%lu",
                     status.ip,
                     (unsigned long)pdTICKS_TO_MS(xTaskGetTickCount() -
                                                 request_start_tick));
            return WIFI_WAKEUP_WAIT_READY;
        }

        if (!wifi_status_is_progressing(status)) {
            if (final_status != NULL) {
                *final_status = status;
            }
            ESP_LOGW(TAG,
                     "wifi_wakeup deferred result stopped state=%s last=%d reason=%d",
                     ServerNetworkSta_StateName(status.state),
                     status.last_result,
                     status.disconnect_reason);
            return WIFI_WAKEUP_WAIT_TERMINAL;
        }

        TickType_t now = xTaskGetTickCount();
        TickType_t total_elapsed_ticks = now - request_start_tick;
        TickType_t grace_elapsed_ticks = now - grace_start_tick;
        if (total_elapsed_ticks >= total_timeout_ticks ||
            grace_elapsed_ticks >= grace_timeout_ticks) {
            /*
             * Re-read once at the boundary so READY cannot race with the
             * final 1307 notification.
             */
            server_network_sta_status_t boundary_status = {};
            if (ServerNetworkSta_GetStatus(&boundary_status) == ESP_OK) {
                status = boundary_status;
            }
            if (final_status != NULL) {
                *final_status = status;
            }
            if (wifi_status_is_ready(status)) {
                ESP_LOGI(TAG,
                         "wifi_wakeup recovered at notify timeout boundary ip=%s",
                         status.ip);
                return WIFI_WAKEUP_WAIT_READY;
            }
            ESP_LOGW(TAG,
                     "wifi_wakeup grace expired state=%s last=%d grace_ms=%lu total_ms=%lu",
                     ServerNetworkSta_StateName(status.state),
                     status.last_result,
                     (unsigned long)pdTICKS_TO_MS(grace_elapsed_ticks),
                     (unsigned long)pdTICKS_TO_MS(total_elapsed_ticks));
            return WIFI_WAKEUP_WAIT_NOTIFY_TIMEOUT;
        }

        TickType_t total_remaining_ticks =
            total_timeout_ticks - total_elapsed_ticks;
        TickType_t grace_remaining_ticks =
            grace_timeout_ticks - grace_elapsed_ticks;
        TickType_t delay_ticks = poll_ticks;
        if (delay_ticks > total_remaining_ticks) {
            delay_ticks = total_remaining_ticks;
        }
        if (delay_ticks > grace_remaining_ticks) {
            delay_ticks = grace_remaining_ticks;
        }
        vTaskDelay(delay_ticks);
    }
}

static int wait_wifi_wakeup_power_guard_or_pending_config(
    TickType_t request_start_tick,
    server_network_sta_status_t *final_status)
{
    const TickType_t timeout_ticks =
        pdMS_TO_TICKS(WIFI_CONNECT_POWER_GUARD_MAX_MS);
    const TickType_t poll_ticks =
        pdMS_TO_TICKS(WIFI_WAKEUP_RESULT_POLL_DELAY_MS);
    server_network_sta_status_t status = {};
    bool status_error_logged = false;

    while ((xTaskGetTickCount() - request_start_tick) < timeout_ticks) {
        if (wifi_config_is_queued_behind_wakeup()) {
            if (final_status != NULL) {
                *final_status = status;
            }
            return WIFI_WAKEUP_WAIT_CONFIG_QUEUED;
        }
        if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
            if (!status_error_logged) {
                ESP_LOGE(TAG,
                         "wifi_wakeup power guard status read failed; guard remains active");
                status_error_logged = true;
            }
            vTaskDelay(poll_ticks);
            continue;
        }
        if (wifi_status_is_ready(status)) {
            if (final_status != NULL) {
                *final_status = status;
            }
            return WIFI_WAKEUP_WAIT_READY;
        }
        if (!wifi_status_is_progressing(status)) {
            if (final_status != NULL) {
                *final_status = status;
            }
            return WIFI_WAKEUP_WAIT_TERMINAL;
        }
        vTaskDelay(poll_ticks);
    }

    if (final_status != NULL) {
        (void)ServerNetworkSta_GetStatus(final_status);
    }
    return WIFI_WAKEUP_WAIT_POWER_GUARD_TIMEOUT;
}

static bool notify_wifi_info_if_ip_ready(json_sender_t reply_sender,
                                         const char *reason,
                                         bool allow_recheck,
                                         bool *ip_ready_out)
{
    server_network_sta_status_t status = {};

    if (ip_ready_out != NULL) {
        *ip_ready_out = false;
    }

    if (reply_sender == NULL) {
        ESP_LOGE(TAG, "wifi_info_result notify skipped reason=%s sender=NULL",
                 reason != NULL ? reason : "<null>");
        return false;
    }

    s_active_send_json = reply_sender;
    if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
        ESP_LOGE(TAG, "wifi_info_result notify status read failed reason=%s",
                 reason != NULL ? reason : "<null>");
        return false;
    }

    for (int recheck = 1;
         (!(status.state == SERVER_NETWORK_STA_STATE_READY &&
            status.has_ip &&
            status.http_ready &&
            status.ip[0] != '\0')) &&
         allow_recheck &&
         recheck <= WIFI_INFO_IP_READY_RECHECK_COUNT;
         recheck++) {
        ESP_LOGW(TAG,
                 "wifi_info_result notify waiting for network ready reason=%s state=%d last=%d http_ready=%d ip=%s recheck=%d/%d",
                 reason != NULL ? reason : "<null>",
                 (int)status.state,
                 status.last_result,
                 status.http_ready ? 1 : 0,
                 status.ip[0] != '\0' ? status.ip : "<empty>",
                 recheck,
                 WIFI_INFO_IP_READY_RECHECK_COUNT);
        vTaskDelay(pdMS_TO_TICKS(WIFI_INFO_IP_READY_RECHECK_DELAY_MS));
        memset(&status, 0, sizeof(status));
        if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
            ESP_LOGE(TAG, "wifi_info_result notify status reread failed reason=%s recheck=%d/%d",
                     reason != NULL ? reason : "<null>",
                     recheck,
                     WIFI_INFO_IP_READY_RECHECK_COUNT);
            return false;
        }
    }

    if (status.state == SERVER_NETWORK_STA_STATE_READY &&
        status.has_ip &&
        status.http_ready &&
        status.ip[0] != '\0') {
        if (ip_ready_out != NULL) {
            *ip_ready_out = true;
        }
        ESP_LOGI(TAG, "wifi_info_result notify call send_base_info reason=%s ip=%s",
                 reason != NULL ? reason : "<null>",
                 status.ip);
        return send_base_info_to_mobile();
    }

    ESP_LOGW(TAG,
             "wifi_info_result notify not ready reason=%s state=%d last=%d http_ready=%d ip=%s",
             reason != NULL ? reason : "<null>",
             (int)status.state,
             status.last_result,
             status.http_ready ? 1 : 0,
             status.ip[0] != '\0' ? status.ip : "<empty>");
    return false;
}

