tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
typedef struct {
    json_sender_t reply_sender;
    TickType_t request_start_tick;
} wifi_wakeup_observer_context_t;

static void wifi_wakeup_existing_progress_observer_task(void *arg)
{
    wifi_wakeup_observer_context_t *context =
        static_cast<wifi_wakeup_observer_context_t *>(arg);
    json_sender_t reply_sender = context != NULL ? context->reply_sender : NULL;
    TickType_t request_start_tick = context != NULL ?
                                    context->request_start_tick :
                                    xTaskGetTickCount();
    free(context);

    server_network_sta_status_t final_status = {};
    int wait_result = wait_wifi_wakeup_ready_during_grace(
        request_start_tick, &final_status);
    if (wait_result == WIFI_WAKEUP_WAIT_READY) {
        (void)notify_wifi_info_if_ip_ready(reply_sender,
                                           "wifi_wakeup_existing_progress",
                                           false,
                                           NULL);
    } else if (wait_result != WIFI_WAKEUP_WAIT_CONFIG_QUEUED) {
        ESP_LOGW(TAG,
                 "wifi_wakeup existing progress final result=1307 state=%s reason=%d",
                 ServerNetworkSta_StateName(final_status.state),
                 final_status.disconnect_reason);
        send_simple_result_with_sender(reply_sender,
                                       "wifi_wakeup_result",
                                       TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                       "WiFi connect timed out");
    }

    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    s_wifi_wakeup_observer_active = false;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    vTaskDelete(NULL);
}

static esp_err_t start_wifi_wakeup_existing_progress_observer(
    json_sender_t reply_sender)
{
    wifi_wakeup_observer_context_t *context =
        static_cast<wifi_wakeup_observer_context_t *>(
            calloc(1, sizeof(*context)));
    if (context == NULL) {
        return ESP_ERR_NO_MEM;
    }
    context->reply_sender = reply_sender;
    context->request_start_tick = xTaskGetTickCount();

    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    if (s_wifi_wakeup_observer_active) {
        portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
        free(context);
        return ESP_OK;
    }
    s_wifi_wakeup_observer_active = true;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);

    BaseType_t task_ret = xTaskCreate(
        wifi_wakeup_existing_progress_observer_task,
        "wifi_wakeup_observe",
        4096,
        context,
        4,
        NULL);
    if (task_ret != pdPASS) {
        portENTER_CRITICAL(&s_wifi_connect_flow_lock);
        s_wifi_wakeup_observer_active = false;
        portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
        free(context);
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(TAG,
             "wifi_wakeup existing progress observer started timeout_ms=%u",
             WIFI_WAKEUP_EARLY_1307_GRACE_MS);
    return ESP_OK;
}

static void wifi_connect_task(void *arg)
{
    (void)arg;
    wait_wifi_connect_task_published();
    json_sender_t reply_sender = s_wifi_connect_reply_sender;
    bool notify_result = s_wifi_connect_notify_result;
    const char *result_func = s_wifi_connect_result_func != NULL
                                  ? s_wifi_connect_result_func
                                  : "wifi_wakeup_result";
    bool new_credential = s_wifi_connect_new_credential;
    TickType_t request_start_tick = s_wifi_connect_request_start_tick != 0
                                        ? s_wifi_connect_request_start_tick
                                        : xTaskGetTickCount();
    s_wifi_connect_reply_sender = NULL;
    s_wifi_connect_notify_result = false;
    s_wifi_connect_result_func = NULL;
    s_wifi_connect_new_credential = false;
    s_wifi_connect_request_start_tick = 0;

    while (true) {
        bool is_wakeup_result =
            strcmp(result_func, "wifi_wakeup_result") == 0;
        uint8_t init_result = new_credential
                                  ? ::User_Network_mode_app_new_credential("/data")
                                  : ::User_Network_mode_app_init("/data");
        int connect_result = ServerNetworkSta_GetLastConnectResult();
        ESP_LOGI(TAG,
                 "BLE/CH583 WiFi initial wait finished func=%s init=%u connect_result=%d",
                 result_func,
                 (unsigned int)init_result,
                 connect_result);

        bool wakeup_ready_after_wait = false;
        bool config_ready_after_wait = false;
        bool config_timed_out_after_wait = false;
        int wakeup_wait_result = WIFI_WAKEUP_WAIT_TERMINAL;
        server_network_sta_status_t wakeup_status = {};
        bool cancel_wakeup_for_config =
            is_wakeup_result && wifi_config_is_queued_behind_wakeup();
        if (init_result != SERVER_NETWORK_STA_CONNECT_SUPERSEDED &&
            init_result != SERVER_NETWORK_STA_OK &&
            connect_result == TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT &&
            is_wakeup_result &&
            !cancel_wakeup_for_config) {
            esp_err_t status_ret =
                ServerNetworkSta_GetStatus(&wakeup_status);
            if (status_ret == ESP_OK &&
                wifi_status_is_progressing(wakeup_status)) {
                ESP_LOGW(TAG,
                         "wifi_wakeup early 1307 suppressed grace_ms=%u state=%s "
                         "retry=%lu retry_after_ms=%lu",
                         WIFI_WAKEUP_EARLY_1307_GRACE_MS,
                         ServerNetworkSta_StateName(wakeup_status.state),
                         (unsigned long)wakeup_status.wifi_retry_count,
                         (unsigned long)wifi_retry_after_ms(wakeup_status));
                wakeup_wait_result =
                    wait_wifi_wakeup_ready_during_grace(request_start_tick,
                                                        &wakeup_status);
                wakeup_ready_after_wait =
                    wakeup_wait_result == WIFI_WAKEUP_WAIT_READY;
                cancel_wakeup_for_config =
                    wakeup_wait_result == WIFI_WAKEUP_WAIT_CONFIG_QUEUED;
                if (!wakeup_ready_after_wait) {
                    connect_result = wakeup_status.last_result;
                }
            } else if (status_ret != ESP_OK) {
                ESP_LOGE(TAG,
                         "wifi_wakeup early 1307 status read failed err=%s",
                         esp_err_to_name(status_ret));
                wakeup_wait_result = WIFI_WAKEUP_WAIT_STATUS_ERROR;
            }
        }

        if (init_result != SERVER_NETWORK_STA_CONNECT_SUPERSEDED &&
            init_result != SERVER_NETWORK_STA_OK &&
            connect_result == TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT &&
            new_credential &&
            !is_wakeup_result) {
            /* A manager request can fail on one NO_AP scan; protocol 1307 is
             * reserved for the complete new-credential result window. */
            uint32_t elapsed_ms = (uint32_t)pdTICKS_TO_MS(
                xTaskGetTickCount() - request_start_tick);
            uint32_t remaining_ms =
                elapsed_ms < WIFI_CONFIG_RESULT_TIMEOUT_MS
                    ? WIFI_CONFIG_RESULT_TIMEOUT_MS - elapsed_ms
                    : 0U;
            if (remaining_ms > 0U) {
                ESP_LOGW(TAG,
                         "WiFi config early 1307 deferred elapsed_ms=%lu remaining_ms=%lu",
                         (unsigned long)elapsed_ms,
                         (unsigned long)remaining_ms);
            }
            wifi_config_observe_result_t observe_result =
                wait_wifi_config_result_until_deadline(request_start_tick);
            config_ready_after_wait =
                observe_result == WIFI_CONFIG_OBSERVE_READY;
            if (observe_result == WIFI_CONFIG_OBSERVE_AUTH_FAILED) {
                connect_result = TDX_JSON_RESULT_WIFI_AUTH_FAILED;
            } else if (!config_ready_after_wait) {
                connect_result = TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT;
                config_timed_out_after_wait = true;
            }
        }

        if (is_wakeup_result && wifi_config_is_queued_behind_wakeup()) {
            cancel_wakeup_for_config = true;
        }

        if (!cancel_wakeup_for_config) {
            if (notify_result && reply_sender != NULL) {
                if (init_result == SERVER_NETWORK_STA_CONNECT_SUPERSEDED) {
                    send_simple_result_with_sender(reply_sender,
                                                   result_func,
                                                   TDX_JSON_RESULT_BUSY,
                                                   "WiFi connect request superseded");
                } else if (init_result == SERVER_NETWORK_STA_OK ||
                           wakeup_ready_after_wait ||
                           config_ready_after_wait) {
                    bool ip_ready = false;
                    const char *notify_reason =
                        wakeup_ready_after_wait
                            ? "wifi_wakeup_retry_ready"
                            : config_ready_after_wait
                                  ? "wifi_config_retry_ready"
                                  : "wifi_connect_task";
                    if (!notify_wifi_info_if_ip_ready(
                            reply_sender,
                            notify_reason,
                            !(wakeup_ready_after_wait ||
                              config_ready_after_wait),
                            &ip_ready)) {
                        if (ip_ready) {
                            ESP_LOGE(TAG,
                                     "WiFi got IP but wifi_info_result send failed");
                        } else {
                            ESP_LOGW(TAG,
                                     "WiFi connect result OK but network was not ready for wifi_info_result");
                            send_simple_result_with_sender(
                                reply_sender,
                                result_func,
                                TDX_JSON_RESULT_WIFI_GOT_IP_FAILED,
                                "WiFi network was not ready");
                        }
                    }
                } else if (connect_result ==
                           TDX_JSON_RESULT_WIFI_AUTH_FAILED) {
                    send_simple_result_with_sender(
                        reply_sender,
                        result_func,
                        TDX_JSON_RESULT_WIFI_AUTH_FAILED,
                        "WiFi authentication failed");
                } else if (connect_result ==
                           TDX_JSON_RESULT_WIFI_GOT_IP_FAILED) {
                    send_simple_result_with_sender(
                        reply_sender,
                        result_func,
                        TDX_JSON_RESULT_WIFI_GOT_IP_FAILED,
                        "WiFi did not obtain IP");
                } else {
                    send_simple_result_with_sender(
                        reply_sender,
                        result_func,
                        TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                        "WiFi connect timed out");
                }
            } else {
                ESP_LOGW(TAG,
                         "WiFi connect task finished without notify sender notify=%d sender_set=%d result=%d",
                         notify_result ? 1 : 0,
                         reply_sender != NULL ? 1 : 0,
                         connect_result);
            }
        }

        if (new_credential) {
            ServerNetworkStaWifiRecovery_OnCredentialResultFinished();
        }

        if (is_wakeup_result && wifi_config_is_queued_behind_wakeup()) {
            cancel_wakeup_for_config = true;
        }
        bool keep_power_guard_observer =
            is_wakeup_result &&
            !cancel_wakeup_for_config &&
            ((wakeup_wait_result == WIFI_WAKEUP_WAIT_NOTIFY_TIMEOUT &&
              wifi_status_is_progressing(wakeup_status)) ||
             wakeup_wait_result == WIFI_WAKEUP_WAIT_STATUS_ERROR);
        if (keep_power_guard_observer) {
            int guard_wait_result =
                wait_wifi_wakeup_power_guard_or_pending_config(
                    request_start_tick,
                    &wakeup_status);
            cancel_wakeup_for_config =
                guard_wait_result == WIFI_WAKEUP_WAIT_CONFIG_QUEUED;
            if (!cancel_wakeup_for_config) {
                const char *clear_reason =
                    guard_wait_result == WIFI_WAKEUP_WAIT_READY
                        ? "ready_after_1307"
                        : guard_wait_result == WIFI_WAKEUP_WAIT_TERMINAL
                              ? "terminal_after_1307"
                              : "deadline";
                ServerNetworkStaWifiWorkTime_ClearWifiConnectGuard(
                    clear_reason);
            }
        } else if (!cancel_wakeup_for_config) {
            const char *clear_reason =
                (init_result == SERVER_NETWORK_STA_OK ||
                 wakeup_ready_after_wait ||
                 config_ready_after_wait)
                    ? "ready"
                    : config_timed_out_after_wait
                          ? "timeout"
                          : "terminal";
            ServerNetworkStaWifiWorkTime_ClearWifiConnectGuard(clear_reason);
        }

