tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
        json_sender_t pending_sender = NULL;
        TickType_t pending_request_start_tick = 0;
        int pending_action = WIFI_PENDING_TAKE_WAIT;
        while (pending_action == WIFI_PENDING_TAKE_WAIT) {
            pending_action =
                take_pending_wifi_config_or_finish(&pending_sender,
                                                   &pending_request_start_tick);
            if (pending_action == WIFI_PENDING_TAKE_WAIT) {
                vTaskDelay(pdMS_TO_TICKS(WIFI_WAKEUP_RESULT_POLL_DELAY_MS));
            }
        }
        if (pending_action != WIFI_PENDING_TAKE_READY) {
            break;
        }

        ESP_LOGI(TAG, "apply queued WiFi credential after wifi_wakeup");
        TickType_t pending_elapsed_ticks =
            xTaskGetTickCount() - pending_request_start_tick;
        uint32_t pending_elapsed_ms =
            (uint32_t)pdTICKS_TO_MS(pending_elapsed_ticks);
        uint32_t pending_guard_remaining_ms =
            pending_elapsed_ms < WIFI_CONNECT_POWER_GUARD_MAX_MS
                ? WIFI_CONNECT_POWER_GUARD_MAX_MS - pending_elapsed_ms
                : 1U;
        ServerNetworkStaWifiWorkTime_StartWifiConnectGuard(
            pending_guard_remaining_ms);
        request_start_tick = pending_request_start_tick;
        reply_sender = pending_sender;
        notify_result = true;
        result_func = "wifi_result";
        new_credential = true;
    }

    WiFi_config_from_ch583 = false;
    WiFi_config_from_ble = false;
    vTaskDelete(NULL);
}

static esp_err_t submit_wifi_connect(json_sender_t reply_sender,
                                     bool notify_result,
                                     const char *result_func,
                                     bool new_credential,
                                     TickType_t request_start_tick)
{
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    if (s_wifi_connect_task != NULL || s_wifi_connect_submit_in_progress) {
        portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
        return ESP_ERR_INVALID_STATE;
    }
    s_wifi_connect_submit_in_progress = true;
    s_wifi_connect_reply_sender = reply_sender;
    s_wifi_connect_notify_result = notify_result;
    s_wifi_connect_result_func = result_func;
    s_wifi_connect_new_credential = new_credential;
    s_wifi_connect_request_start_tick = request_start_tick;
    s_wifi_connect_wakeup_flow =
        result_func != NULL &&
        strcmp(result_func, "wifi_wakeup_result") == 0;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    uint32_t elapsed_ms = (uint32_t)pdTICKS_TO_MS(
        xTaskGetTickCount() - request_start_tick);
    uint32_t guard_remaining_ms =
        elapsed_ms < WIFI_CONNECT_POWER_GUARD_MAX_MS
            ? WIFI_CONNECT_POWER_GUARD_MAX_MS - elapsed_ms
            : 1U;
    ServerNetworkStaWifiWorkTime_StartWifiConnectGuard(guard_remaining_ms);
    TaskHandle_t created_task = NULL;
    if (xTaskCreate(wifi_connect_task,
                    "ble_wifi_connect",
                    6144,
                    NULL,
                    4,
                    &created_task) != pdPASS) {
        portENTER_CRITICAL(&s_wifi_connect_flow_lock);
        s_wifi_connect_reply_sender = NULL;
        s_wifi_connect_notify_result = false;
        s_wifi_connect_result_func = NULL;
        s_wifi_connect_new_credential = false;
        s_wifi_connect_request_start_tick = 0;
        s_wifi_connect_submit_in_progress = false;
        s_wifi_connect_wakeup_flow = false;
        portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
        ServerNetworkStaWifiWorkTime_ClearWifiConnectGuard(
            "task_create_failed");
        return ESP_ERR_NO_MEM;
    }
    portENTER_CRITICAL(&s_wifi_connect_flow_lock);
    s_wifi_connect_task = created_task;
    s_wifi_connect_submit_in_progress = false;
    portEXIT_CRITICAL(&s_wifi_connect_flow_lock);
    return ESP_OK;
}

int parse_wifi_config_json(const char *json_str, wifi_config_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;
    cJSON *item_ssid = NULL;
    cJSON *item_key = NULL;

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    /* 涓枃娉ㄩ噴锛?      鍏堟竻绌鸿緭鍑虹粨鏋勪綋锛岄伩鍏嶆畫鐣欐棫鏁版嵁    */
    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    item_func = cJSON_GetObjectItem(root, "func");
    item_ssid = cJSON_GetObjectItem(root, "ssid");
    item_key = cJSON_GetObjectItem(root, "key");

    /* 涓枃娉ㄩ噴锛?      妫€鏌ュ瓧娈垫槸鍚﹀瓨鍦ㄤ笖鏄瓧绗︿覆    */

    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL ||
        !cJSON_IsString(item_ssid) || item_ssid->valuestring == NULL ||
        !cJSON_IsString(item_key) || item_key->valuestring == NULL) {
        cJSON_Delete(root);
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    server_network_sta_wifi_credential_result_t validation =
        ServerNetworkStaWifiCredential_Validate(item_ssid->valuestring,
                                                item_key->valuestring);
    if (validation != SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK) {
        ESP_LOGW(TAG,
                 "WiFi JSON credential rejected reason=%s ssid_len=%u password_len=%u",
                 ServerNetworkStaWifiCredential_ResultName(validation),
                 (unsigned int)strlen(item_ssid->valuestring),
                 (unsigned int)strlen(item_key->valuestring));
        cJSON_Delete(root);
        return -1;
    }

    // Copy only after validating complete UTF-8 byte sequences and lengths.
    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);
    memcpy(out->ssid, item_ssid->valuestring,
           strlen(item_ssid->valuestring) + 1U);
    memcpy(out->key, item_key->valuestring,
           strlen(item_key->valuestring) + 1U);

    cJSON_Delete(root);
    Bl_Data_Ready =1;
    TickType_t config_request_start_tick = xTaskGetTickCount();

    // Keep this scope local; s_wifi_connect_task is the single BLE/CH583 BUSY guard.
    {
            uint32_t pending_reservation =
                reserve_wifi_config_behind_wakeup(s_active_send_json,
                                                  config_request_start_tick);
            if (pending_reservation == 0 &&
                wifi_connect_task_is_active()) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_BUSY,
                                               "WiFi connect already in progress");
                return 0;
            }
            ServerNetworkStaWifiRecovery_OnCredentialResultStarted();
            auto& wifi_ap = WifiConfigurationAp::GetInstance();
            std::string wifi_ssid = out->ssid;
            std::string wifi_password = out->key;
            UserDebugOutput_Printf("The Wifi info parsed ok, save to NVS\n\r");
            SsidManager::GetInstance().Clear();
            esp_err_t save_ret = wifi_ap.Save(wifi_ssid, wifi_password);
            if (save_ret != ESP_OK) {
                (void)finish_wifi_config_reservation(pending_reservation,
                                                     false);
                ServerNetworkStaWifiRecovery_OnCredentialResultFinished();
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_WIFI_SAVE_FAILED,
                                               "save WiFi config failed");
                return 0;
            }
            esp_err_t recovery_ret =
                ServerNetworkStaWifiRecovery_OnCredentialsChanged();
            if (recovery_ret != ESP_OK) {
                ESP_LOGE(TAG,
                         "WiFi recovery reset after credential save failed ret=%s",
                         esp_err_to_name(recovery_ret));
            }

            if (pending_reservation != 0) {
                if (finish_wifi_config_reservation(pending_reservation, true)) {
                    WiFi_config_net = true;
                    Wifi_connect_OK = 1;
                    ESP_LOGI(TAG,
                             "WiFi config queued behind wifi_wakeup; latest saved credential wins");
                    send_simple_result_with_sender(
                        s_active_send_json,
                        "wifi_result",
                        TDX_JSON_RESULT_OK,
                        "WiFi config saved and queued");
                    return 0;
                }
                if (wifi_connect_task_is_active()) {
                    ESP_LOGW(TAG,
                             "WiFi pending reservation superseded before publication");
                    send_simple_result_with_sender(
                        s_active_send_json,
                        "wifi_result",
                        TDX_JSON_RESULT_BUSY,
                        "WiFi config superseded by a newer request");
                    return 0;
                }
                ESP_LOGW(TAG,
                         "WiFi wakeup owner ended during config save; submit saved credential directly");
            }

            esp_err_t submit_ret = submit_wifi_connect(
                s_active_send_json,
                true,
                "wifi_result",
                true,
                config_request_start_tick);
            if (submit_ret != ESP_OK) {
                ServerNetworkStaWifiRecovery_OnCredentialResultFinished();
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               submit_ret == ESP_ERR_INVALID_STATE
                                                   ? TDX_JSON_RESULT_BUSY
                                                   : TDX_JSON_RESULT_WIFI_CONNECT_SUBMIT_FAILED,
                                               "submit WiFi connect failed");
                return 0;
            }

            WiFi_config_net = true;
            Wifi_connect_OK = 1;
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_result",
                                           TDX_JSON_RESULT_OK,
                                           "WiFi config saved and connect submitted");

