tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
            //LOG_Purple("esp_restart .. %s>%d",__func__,__LINE__);
            //vTaskDelay(pdMS_TO_TICKS(1000));                    
            //esp_restart();                            // Restart device to apply new WiFi configuration
    }
    return 0;
}

int parse_wifi_wakeup_json(const char *json_str, wifi_config_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    
    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
        LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    item_func = cJSON_GetObjectItem(root, "func");

    
    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL) {
        cJSON_Delete(root);
        LOG_ERROR("xxInvalid JSON");
        return -1;
    }

    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);
    if (strcmp(out->func, "wifi_wakeup") == 0) {
        UserDebugOutput_Printf("wakeup-ok\r\n");
    }
    else
    {
        UserDebugOutput_Printf("wakeup-fail\r\n");
        return -1;
    }
    cJSON_Delete(root);
    server_network_sta_status_t status = {};
    (void)ServerNetworkSta_GetStatus(&status);
    if (status.state == SERVER_NETWORK_STA_STATE_READY &&
        status.has_ip && status.ip[0] != '\0')
    {
       ServerNetworkStaWifiWorkTime_ClearWifiConnectGuard(
           "wakeup_already_ready");
       (void)notify_wifi_info_if_ip_ready(s_active_send_json, "wifi_wakeup_got_ip", false, NULL);
    }
    else if (wifi_status_is_progressing(status))
    {
        /*
         * This path observes an existing manager attempt and does not create
         * wifi_connect_task, so use the bounded auto-expiring guard directly.
         */
        (void)ServerNetworkStaWifiWorkTime_StartWifiConnectGuardIfInactive(
            WIFI_CONNECT_POWER_GUARD_MAX_MS);
        char reply_json[256];
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"wifi_wakeup_result\",\"result\":%d,"
                 "\"message\":\"WiFi operation in progress\",\"stage\":\"%s\","
                 "\"state\":\"%s\",\"retry_type\":%d,\"retry_after_ms\":%lu}",
                 TDX_JSON_RESULT_OK,
                 wifi_stage_from_status(status),
                 ServerNetworkSta_StateName(status.state),
                 (int)status.retry_type,
                 (unsigned long)wifi_retry_after_ms(status));
        (void)s_active_send_json(reply_json);
        ESP_LOGI(TAG, "WiFi wakeup reports existing state=%s retry_ms=%lu",
                 ServerNetworkSta_StateName(status.state),
                 (unsigned long)wifi_retry_after_ms(status));
        esp_err_t observer_ret =
            start_wifi_wakeup_existing_progress_observer(s_active_send_json);
        if (observer_ret != ESP_OK) {
            ESP_LOGE(TAG,
                     "wifi_wakeup existing progress observer start failed ret=%s",
                     esp_err_to_name(observer_ret));
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_wakeup_result",
                                           TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                           "WiFi connect timed out");
        }
    }
    else if (status.state == SERVER_NETWORK_STA_STATE_AUTH_FAILED)
    {
        send_simple_result_with_sender(s_active_send_json,
                                       "wifi_wakeup_result",
                                       TDX_JSON_RESULT_WIFI_AUTH_FAILED,
                                       "WiFi authentication failed");
    }
    else if (!ble_has_saved_wifi_info()) {
        ESP_LOGW(TAG, "No saved WiFi credential");
        char reply_json[160];
        snprintf(reply_json, sizeof(reply_json),
                    "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"wakeup No-WiFi\",\"stage\":\"error\"}",
                    TDX_JSON_RESULT_BLE_NO_SAVED_WIFI);

            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
                // 杈撳嚭缁撴灉
                UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
    }
    else {
        if (wifi_connect_task_is_active()) {
            ESP_LOGW(TAG,
                     "WiFi wakeup ignored: connection task already in progress");
            return 0;
        }
        esp_err_t submit_ret = submit_wifi_connect(
            s_active_send_json,
            true,
            "wifi_wakeup_result",
            false,
            xTaskGetTickCount());
        if (submit_ret == ESP_OK) {
            char reply_json[192];
            snprintf(reply_json, sizeof(reply_json),
                     "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"WiFi wakeup submitted\",\"stage\":\"connecting\"}",
                     TDX_JSON_RESULT_OK);
            (void)s_active_send_json(reply_json);
        } else if (submit_ret == ESP_ERR_INVALID_STATE) {
            ESP_LOGW(TAG, "WiFi wakeup ignored: connection task already in progress");
        } else {
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_wakeup_result",
                                           TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                           "WiFi wakeup submit failed");
        }
    }

    return 0;
}

int parse_wifi_work_time_json(const char *json_str, wifi_work_time_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;
    cJSON *item_seconds = NULL;
    cJSON *item_time = NULL;
    cJSON *item_duration = NULL;
    char reply_json[160];
    esp_err_t set_ret = ESP_OK;

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
        LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

