tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
    item_func = cJSON_GetObjectItem(root, "func");
    item_seconds = cJSON_GetObjectItem(root, "seconds");
    item_time = cJSON_GetObjectItem(root, "time");

    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL) {
        cJSON_Delete(root);
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);

    if (strcmp(out->func, "set_wifi_work_time") != 0 && strcmp(out->func, "wifi_standby") != 0) {
        cJSON_Delete(root);
        return -1;
    }

    item_duration = cJSON_IsNumber(item_seconds) ? item_seconds : item_time;
    if (!cJSON_IsNumber(item_duration)) {
        cJSON_Delete(root);
        LOG_ERROR("set_wifi_work_time JSON missing seconds/time");
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 TDX_JSON_RESULT_WIFI_WORK_TIME_MISSING);
            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
        return 0;
    }

    if (item_duration->valueint < SERVER_NETWORK_STA_WIFI_WORK_TIME_MIN_SECONDS ||
        item_duration->valueint > SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS) {
        cJSON_Delete(root);
        LOG_ERROR("set_wifi_work_time JSON invalid");
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 TDX_JSON_RESULT_WIFI_WORK_TIME_RANGE);
            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
        return 0;
    }

    out->seconds = item_duration->valueint;
    set_ret = ServerNetworkStaWifiWorkTime_SetAndSave((uint32_t)out->seconds);
    cJSON_Delete(root);

    if (set_ret == ESP_OK) {
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 set_ret == ESP_ERR_INVALID_STATE
                     ? TDX_JSON_RESULT_WIFI_WORK_TIME_APPLY_FAILED
                     : TDX_JSON_RESULT_WIFI_WORK_TIME_SAVE_FAILED);
    }

            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif

    return 0;
}

static void handle_wifi_json_text_with_sender(const char *json_text,
                                              json_sender_t send_json,
                                              bool reply_to_ch583)
{
    if (json_text == NULL || json_text[0] == '\0') {
        send_simple_result_with_sender(send_json, "ble_json_result", TDX_JSON_RESULT_BLE_JSON_EMPTY, "empty json");
        return;
    }

    if (ServerNetworkStaWifiCredential_JsonHasEmbeddedNul(
            json_text, strlen(json_text))) {
        ESP_LOGW(TAG, "BLE/CH583 JSON rejected reason=embedded_nul");
        send_simple_result_with_sender(send_json,
                                       "ble_json_result",
                                       TDX_JSON_RESULT_BLE_JSON_PARSE_FAILED,
                                       "invalid json");
        return;
    }

    ESP_LOGI(TAG, "RX JSON ch583=%d: %s", reply_to_ch583 ? 1 : 0, json_text);

    cJSON *root = cJSON_Parse(json_text);
    if (root == NULL) {
        send_simple_result_with_sender(send_json,
                                       "ble_json_result",
                                       TDX_JSON_RESULT_BLE_JSON_PARSE_FAILED,
                                       "invalid json");
        return;
    }
    cJSON *func_item = cJSON_GetObjectItemCaseSensitive(root, "func");
    if (!cJSON_IsString(func_item) || func_item->valuestring == NULL) {
        cJSON_Delete(root);
        send_simple_result_with_sender(send_json,
                                       "ble_json_result",
                                       TDX_JSON_RESULT_BLE_FUNC_UNSUPPORTED,
                                       "missing func");
        return;
    }

    char func[32];
    strlcpy(func, func_item->valuestring, sizeof(func));
    if (strcmp(func, "wifi") == 0) {
        cJSON *ssid_item = cJSON_GetObjectItemCaseSensitive(root, "ssid");
        cJSON *key_item = cJSON_GetObjectItemCaseSensitive(root, "key");
        int validation_result = TDX_JSON_RESULT_OK;
        const char *validation_message = NULL;
        if (ssid_item == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_SSID_MISSING;
            validation_message = "ssid missing";
        } else if (key_item == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_KEY_MISSING;
            validation_message = "key missing";
        } else if (!cJSON_IsString(ssid_item) || ssid_item->valuestring == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_SSID_INVALID;
            validation_message = "ssid invalid";
        } else if (!cJSON_IsString(key_item) || key_item->valuestring == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_KEY_INVALID;
            validation_message = "key invalid";
        } else {
            server_network_sta_wifi_credential_result_t credential_result =
                ServerNetworkStaWifiCredential_Validate(
                    ssid_item->valuestring, key_item->valuestring);
            if (credential_result != SERVER_NETWORK_STA_WIFI_CREDENTIAL_OK) {
                bool ssid_error =
                    ServerNetworkStaWifiCredential_ResultIsSsidError(
                        credential_result);
                validation_result = ssid_error
                                        ? TDX_JSON_RESULT_WIFI_SSID_INVALID
                                        : TDX_JSON_RESULT_WIFI_KEY_INVALID;
                validation_message = ssid_error
                                         ? "ssid invalid"
                                         : "key invalid";
                ESP_LOGW(TAG,
                         "WiFi request rejected reason=%s ssid_len=%u password_len=%u",
                         ServerNetworkStaWifiCredential_ResultName(
                             credential_result),
                         (unsigned int)strlen(ssid_item->valuestring),
                         (unsigned int)strlen(key_item->valuestring));
            }
        }
        if (validation_result != TDX_JSON_RESULT_OK) {
            cJSON_Delete(root);
            send_simple_result_with_sender(send_json,
                                           "wifi_result",
                                           validation_result,
                                           validation_message);
            return;
        }
    }
    cJSON_Delete(root);
    s_active_send_json = send_json;

